import { Title } from '@/app/shared';
import styles from './FAQ.module.scss';
import { Item } from './Item/Item';

export type TObj = {
  id: number;
  title: string;
  desc: string;
};

const dataQuestions: TObj[] = [
  {
    id: 1,
    title: 'Як швидко ви зможете виконати роботу?',
    desc: `Прання килимів займає від п'яти до семи днів.`,
  },
  {
    id: 2,
    title: 'Які хімічні речовини ви використовуєте?',
    desc: 'Ми користуємося продукцією німецьких, українських та турецьких виробників, які постійно вдосконалюються та мають всі необхідні сертифікати якості.',
  },
  {
    id: 3,
    title: 'Чи безпечно це для тварин та дітей?',
    desc: 'Чистячі засоби, які ми використовуємо в закритих приміщеннях, є безпечними як для людей, так і для домашніх улюбленців.',
  },
  {
    id: 4,
    title: 'Чи не нашкодить чистка меблям та килимам?',
    desc: 'Професійна хімчистка абсолютно безпечна для меблів і килимів. Ми використовуємо тільки перевірені засоби та сучасне обладнання, яке не пошкоджує структуру тканин. Дбайливий підхід і правильний підбір технологій гарантують чистоту без ризику для ваших речей.',
  },
  {
    id: 5,
    title: 'Як часто треба чистити меблі чи прати килими?',
    desc: 'Мінімум 2 рази на рік.',
  },
  {
    id: 6,
    title: 'Після чистки у мене буде новий килим?',
    desc: 'Після професійного пранння у Вас буде чиста річ. Сучасна чистка займається очищенням забруднень, але не може відновити «зношені» вироби. Однак, якщо в процесі експлуатації механічне навантаження було мінімальне, то часто після якісного прання килим знову виглядає як новий.',
  },
];

export const FAQ = () => {
  return (
    <section id="question" className={styles.section}>
      <Title text="ЧАСТІ ЗАПИТАННЯ" />

      <ul className={styles.list}>
        {dataQuestions.map(({ title, desc, id }) => {
          return <Item key={id} title={title} desc={desc} />;
        })}
      </ul>
    </section>
  );
};
