import styles from './FAQ.module.scss';
import { Item } from './Item/Item';

export type TObj = {
  id: number;
  title: string;
  desc: string;
};

const dataQuestions: TObj[] = [
  {
    id: 1,
    title: 'Чи безпечно це для моєї дитини та тварини?',
    desc: 'Dezinsector вживає всі можливі заходи для зменшення ризиків для здоров`я дітей та тварин. Незважаючи на це, замовники повинні дотримуватися певних заходів обережності. Необхідно точно слідувати інструкціям фахівців Dezinsector та уточнювати, коли можна безпечно повертатися в оброблене приміщення. Обов`язково повідомте спеціалістів про наявність дітей та домашніх тварин, щоб вони могли вжити додаткових заходів обережності. Dezinsector завжди піклується про ваше здоровя!',
  },
  {
    id: 2,
    title: 'Як правильно підготувати приміщення перед обробкою?',
    desc: '1) Бажано зробити прибирання, щоб у приміщенні було чисто (це покращить якість обробки). 2) Відсунути меблі на 10-20 см від стін (якщо є така можливість). 3) На кухні звільнити усі шафи, а також сховати усі відкриті продукти харчування. 4) У ванній кімнаті сховати засоби особистої гігієни. Це усе що треба зробити клієнту, а після приїзжає майстер і вже на свій розсуд проводить додаткові роботи по підготовці.',
  },
  {
    id: 3,
    title: 'Скільки часу не можна заходити в приміщення після обробки?',
    desc: 'В залежності від ситуації у приміщенні не можна знаходитися 8-15 годин.',
  },
  {
    id: 4,

    title:
      'Як після дезінcекції додатково захистити квартиру від повторного зараження?',
    desc: 'Найголовніше це виявити і усунити місця, звідки шкідники можуть потрапляти до вашого приміщення. Ще дуже важливо пітримувати регулярну чистоту.',
  },
  {
    id: 5,

    title: 'Які препарати ви використовуєте?',
    desc: 'Ми використовуємо тількі сертифіковані, европейські препарати високої якості, які дуже ефективні і відповідають 3 та 4 класу небезпеки.',
  },
  {
    id: 6,

    title: 'Дуже багато комах, ви точно впораєтеся?',
    desc: 'Зазвичай, коли дуже багато комах, потребується 2 обробки з періодичністю в 2-3 тижні. І як показує практика, при дотриманні усіх рекомендацій і інструкцій результат у 99% випадків успішний.',
  },
  {
    id: 7,

    title: 'Скільки часу займає обробка?',
    desc: 'У середньому обробка займає 30-60 хвилин.',
  },
];

export const FAQ = () => {
  return (
    <section id="question" className={styles.section}>
      <h2 className={styles.title}>FAQ</h2>

      <ul className={styles.list}>
        {dataQuestions.map(({ title, desc, id }) => {
          return <Item key={id} title={title} desc={desc} />;
        })}
      </ul>
    </section>
  );
};
