import { Title } from '@/app/shared';
import styles from './FAQ.module.scss';
import { Item } from './Item/Item';

export type TObj = {
  id: number;
  title: string;
  desc: string;
};

const dataQuestions: TObj[] = [
  {
    id: 1,
    title: 'Як швидко ви зможете виконати роботу?',
    desc: 'Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...',
  },
  {
    id: 2,
    title: 'Які хімічні речовини ви використовуєте?',
    desc: 'Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...',
  },
  {
    id: 3,
    title: 'Чи безпечно це для тварин та дітей?',
    desc: 'Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...',
  },
  {
    id: 4,
    title: 'Чи не нашкодить чистка меблям та килимам?',
    desc: 'Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...',
  },
  {
    id: 5,
    title: 'Як часто треба чистити меблі чи прати килими?',
    desc: 'Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...Все залежить від розміру. Але за добу все буде виконано якщо...',
  },
];

export const FAQ = () => {
  return (
    <section id="question" className={styles.section}>
      <Title text="ЧАСТІ ЗАПИТАННЯ" />

      <ul className={styles.list}>
        {dataQuestions.map(({ title, desc, id }) => {
          return <Item key={id} title={title} desc={desc} />;
        })}
      </ul>
    </section>
  );
};
